Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC01/svd/PIC32CK0512GC01100.svd
               <register>
                  <name>LENGTH</name>
                  <description>USART Length</description>
                  <addressOffset>0x22</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>LEN</name>
                        <description>Data Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>LENEN</name>
                        <description>Data Length Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>LENENSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Length counter is disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TX</name>
                              <description>Length counter is enabled for transmit</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RX</name>
                              <description>Length counter is enabled for receive</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DATA</name>
                  <description>USART Data</description>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>DATA</name>
                        <description>Data Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DBGCTRL</name>
                  <description>USART Debug Control</description>
                  <addressOffset>0x30</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DBGSTOP</name>
                        <description>Debug Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FIFOSPACE</name>
                  <description>USART FIFO Space</description>
                  <addressOffset>0x34</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>TXSPACE</name>
                        <description>Tx FIFO Empty Space</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>RXSPACE</name>
                        <description>Rx FIFO Filled Space</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FIFOPTR</name>
                  <description>USART FIFO CPU Pointers</description>
                  <addressOffset>0x36</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>CPUWRPTR</name>
                        <description>CPU FIFO Write Pointer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>CPURDPTR</name>
                        <description>CPU FIFO Read Pointer</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM1</name>
         <baseAddress>0x44812000</baseAddress>
         <interrupt>
            <name>SERCOM1_56</name>
            <value>50</value>
         </interrupt>
         <interrupt>
            <name>SERCOM1_0</name>
            <value>51</value>
         </interrupt>
         <interrupt>
            <name>SERCOM1_1</name>
            <value>52</value>
         </interrupt>
         <interrupt>
            <name>SERCOM1_2</name>
            <value>53</value>
         </interrupt>
         <interrupt>
            <name>SERCOM1_3</name>
            <value>54</value>
         </interrupt>
         <interrupt>
            <name>SERCOM1_4</name>
            <value>55</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM2</name>
         <baseAddress>0x44814000</baseAddress>
         <interrupt>
            <name>SERCOM2_56</name>
            <value>56</value>
         </interrupt>
         <interrupt>
            <name>SERCOM2_0</name>
            <value>57</value>
         </interrupt>
         <interrupt>
            <name>SERCOM2_1</name>
            <value>58</value>
         </interrupt>
         <interrupt>
            <name>SERCOM2_2</name>
            <value>59</value>
         </interrupt>
         <interrupt>
            <name>SERCOM2_3</name>
            <value>60</value>
         </interrupt>
         <interrupt>
            <name>SERCOM2_4</name>
            <value>61</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM3</name>
         <baseAddress>0x44816000</baseAddress>
         <interrupt>
            <name>SERCOM3_56</name>
            <value>62</value>
         </interrupt>
         <interrupt>
            <name>SERCOM3_0</name>
            <value>63</value>
         </interrupt>
         <interrupt>
            <name>SERCOM3_1</name>
            <value>64</value>
         </interrupt>
         <interrupt>
            <name>SERCOM3_2</name>
            <value>65</value>
         </interrupt>
         <interrupt>
            <name>SERCOM3_3</name>
            <value>66</value>
         </interrupt>
         <interrupt>
            <name>SERCOM3_4</name>
            <value>67</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM4</name>
         <baseAddress>0x45000000</baseAddress>
         <interrupt>
            <name>SERCOM4_56</name>
            <value>96</value>
         </interrupt>
         <interrupt>
            <name>SERCOM4_0</name>
            <value>97</value>
         </interrupt>
         <interrupt>
            <name>SERCOM4_1</name>
            <value>98</value>
         </interrupt>
         <interrupt>
            <name>SERCOM4_2</name>
            <value>99</value>
         </interrupt>
         <interrupt>
            <name>SERCOM4_3</name>
            <value>100</value>
         </interrupt>
         <interrupt>
            <name>SERCOM4_4</name>
            <value>101</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM5</name>
         <baseAddress>0x45002000</baseAddress>
         <interrupt>
            <name>SERCOM5_56</name>
            <value>102</value>
         </interrupt>
         <interrupt>
            <name>SERCOM5_0</name>
            <value>103</value>
         </interrupt>
         <interrupt>
            <name>SERCOM5_1</name>
            <value>104</value>
         </interrupt>
         <interrupt>
            <name>SERCOM5_2</name>
            <value>105</value>
         </interrupt>
         <interrupt>
            <name>SERCOM5_3</name>
            <value>106</value>
         </interrupt>
         <interrupt>
            <name>SERCOM5_4</name>
            <value>107</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM6</name>
         <baseAddress>0x45004000</baseAddress>
         <interrupt>
            <name>SERCOM6_56</name>
            <value>108</value>
         </interrupt>
         <interrupt>
            <name>SERCOM6_0</name>
            <value>109</value>
         </interrupt>
         <interrupt>
            <name>SERCOM6_1</name>
            <value>110</value>
         </interrupt>
         <interrupt>
            <name>SERCOM6_2</name>
            <value>111</value>
         </interrupt>
         <interrupt>
            <name>SERCOM6_3</name>
            <value>112</value>
         </interrupt>
         <interrupt>
            <name>SERCOM6_4</name>
            <value>113</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SERCOM0">
         <name>SERCOM7</name>
         <baseAddress>0x45006000</baseAddress>
         <interrupt>
            <name>SERCOM7_56</name>
            <value>114</value>
         </interrupt>
         <interrupt>
            <name>SERCOM7_0</name>
            <value>115</value>
         </interrupt>
         <interrupt>
            <name>SERCOM7_1</name>
            <value>116</value>
         </interrupt>
         <interrupt>
            <name>SERCOM7_2</name>
            <value>117</value>
         </interrupt>
         <interrupt>
            <name>SERCOM7_3</name>
            <value>118</value>
         </interrupt>
         <interrupt>
            <name>SERCOM7_4</name>
            <value>119</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>SIG</name>
         <version>SYSTEM_IP1.0.0</version>
         <description>Software Interrupt Generation</description>
         <groupName>SIG</groupName>
         <prependToName>SIG_</prependToName>
         <baseAddress>0xE000EF00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>STIR</name>
               <description>Software Triggered Interrupt Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>INTID</name>
                     <description>Interrupt ID to be pended</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
